idolpx/meatloaf/include/pinmap/esp32-s3-dev-kit-n8r8.h
#ifndef ESP32_S3_DEV_KIT_N8R8_H
#define ESP32_S3_DEV_KIT_N8R8_H

// https://docs.waveshare.com/ESP32-S3-DEV-KIT-N8R8
// https://files.waveshare.com/wiki/ESP32-S3-DEV-KIT-N8R8/ESP32-S3-DEV-KIT-N8R8-schematic.pdf
// https://www.espressif.com/sites/default/files/documentation/esp32-s3-wroom-1_wroom-1u_datasheet_en.pdf

#ifdef PINMAP_ESP32_S3_DEV_KIT_N8R8

// ESP32-S3-WROOM-1-N8R8
#define FLASH_SIZE              8
#define PSRAM_SIZE              8

/* SD Card */
#define PIN_CARD_DETECT         GPIO_NUM_NC // fnSystem.h
#define PIN_CARD_DETECT_FIX     GPIO_NUM_NC // fnSystem.h

#define PIN_SD_HOST_CS          GPIO_NUM_11         // GPIO_NUM_46
#define PIN_SD_HOST_MISO        GPIO_NUM_14         // GPIO_NUM_13
#define PIN_SD_HOST_SCK         GPIO_NUM_13         // GPIO_NUM_12
#define PIN_SD_HOST_MOSI        GPIO_NUM_12         // GPIO_NUM_11

/* UART */
#define PIN_UART0_RX            GPIO_NUM_44  // fnUART.cpp
#define PIN_UART0_TX            GPIO_NUM_43
#define PIN_UART1_RX            GPIO_NUM_NC
#define PIN_UART1_TX            GPIO_NUM_NC
#define PIN_UART2_RX            GPIO_NUM_NC
#define PIN_UART2_TX            GPIO_NUM_NC

/* Buttons */
#define PIN_BUTTON_A            GPIO_NUM_0   // keys.cpp
#define PIN_BUTTON_B            GPIO_NUM_NC
#define PIN_BUTTON_C            GPIO_NUM_NC

/* LEDs */
#define PIN_LED_WIFI            GPIO_NUM_1   // led.cpp
#define PIN_LED_BUS             GPIO_NUM_2
#define PIN_LED_BT              GPIO_NUM_NC
#define PIN_LED_RGB             GPIO_NUM_38

/* Audio Output */
#define PIN_DAC1                GPIO_NUM_NC // samlib.h
#define PIN_I2S                 GPIO_NUM_42

/* I2C GPIO Expander */
#define PIN_GPIOX_SDA           GPIO_NUM_9
#define PIN_GPIOX_SCL           GPIO_NUM_10
#define PIN_GPIOX_INT           GPIO_NUM_41
#define GPIOX_ADDRESS           0x20  // PCF8575
//#define GPIOX_ADDRESS           0x24  // PCA9673
#define GPIOX_SPEED             400   // PCF8575 - 400Khz
//#define GPIOX_SPEED             1000  // PCA9673 - 1000Khz / 1Mhz


/* Commodore IEC Pins */
// CLK & DATA lines in/out are split between two pins
//#define IEC_SPLIT_LINES

// Line values are inverted (7406 Hex Inverter Buffer)
//#define IEC_INVERTED_LINES

// Reset line is available
#define IEC_HAS_RESET
                                                //            WIRING
                                                //  C64    DIN6         
#define PIN_IEC_ATN             GPIO_NUM_4      //  ATN    3       orange
#define PIN_IEC_CLK_IN          GPIO_NUM_5      //  CLK    4      yellow
#define PIN_IEC_CLK_OUT         GPIO_NUM_5      //
#define PIN_IEC_DATA_IN         GPIO_NUM_6      //  DATA   5      green
#define PIN_IEC_DATA_OUT        GPIO_NUM_6      //
#define PIN_IEC_SRQ             GPIO_NUM_7      //  SRQ    1     brown 
#define PIN_IEC_RESET           GPIO_NUM_15     //  RESET  6     purple
                                                //  GND    2       blue


/* Modem/Parallel Switch */
#define PIN_MODEM_ENABLE        GPIO_NUM_2  // High = Modem enabled
#define PIN_MODEM_UP9600        GPIO_NUM_15 // High = UP9600 enabled

#endif // PINMAP_ESP32_S3_DEV_KIT_N8R8
#endif // ESP32_S3_DEV_KIT_N8R8_H